---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.EqualityConstraintsUnsatisfiedWarn
source: html/3f6c7f73-e558-3879-e580-5305f6cd1b96.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.EqualityConstraintsUnsatisfiedWarn Property

Equality constraints are not satisfied. The action either violates a locked constraint or tries to modify
 a sketch based object outside of the sketch mode.

## Syntax (C#)
```csharp
public static FailureDefinitionId EqualityConstraintsUnsatisfiedWarn { get; }
```